# Oefeningen op filteren en sorteren
We beginnen met het bestand te downloaden

In [ ]:
from pathlib import Path
import requests
BI_CSV = 'bi.csv'
bi_path = Path(BI_CSV)
if not bi_path.exists():
    data = requests.get('https://learn.walsoftcomputers.com/csv/bi.csv')

    with open(BI_CSV, mode='wb') as f:
        f.write(data.content)

## Oefening 1
Schrijf de code om het bestand te lezen (let op de windows-1252 encoding). Verwachte output:
```
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype  
---  ------         --------------  -----  
 0   fNAME          77 non-null     object 
 1   lNAME          77 non-null     object 
 2   Age            77 non-null     int64  
 3   gender         77 non-null     object 
 4   country        77 non-null     object 
 5   residence      77 non-null     object 
 6   entryEXAM      77 non-null     int64  
 7   prevEducation  77 non-null     object 
 8   studyHOURS     77 non-null     int64  
 9   Python         75 non-null     float64
 10  DB             77 non-null     int64  
dtypes: float64(1), int64(4), object(6)
memory usage: 6.7+ KB
```

In [2]:
import pandas as pd
BI_CSV = 'bi.csv'
df = pd.read_csv(BI_CSV, encoding='windows-1252')

## Oefening 2
Schrijf code om te tonen hoeveel verschillende waarden er zijn voor 'gender'. Let erop dat je geen FutureWarning krijgt.

Verwachte output:
```
np.int64(77)
```

## Oefening 3
Welke functie kun je gebruiken om de lijst van alle waarden voor gender te zien? (meerdere antwoorden mogelijk)
1. df.gender.unique_values()
1. df.gender.unique()
1. df.gender.nunique()
1. pd.unique(df.gender)

In [ ]:
# df.gender.unique_values()  #(1)
# df.gender.unique()         #(2)
# df.gender.nunique()        #(3)
# pd.unique(df.gender)       #(4)

## Oefening 4
Er zijn drie waarden voor 'vrouwelijk': F, female en Female. Hoe kunnen we een lijst maken met alle records waar gender gelijk is aan 'female' of 'Female'
1. df[df.str.casefold('gender')== 'female']
1. df[df.str.casefold(df.gender) == 'female']
1. df[df.gender.str.casefold() == 'female']
1. df[df.gender.string.casefold() == 'female']

In [ ]:
# df[df.str.casefold('gender')== 'female']      #(1)
# df[df.str.casefold(df.gender) == 'female']    #(2)
# df[df.gender.str.casefold() == 'female']      #(3)
# df[df.gender.string.casefold() == 'female']   #(4)

## Oefening 5
We zitten natuurlijk nog met de waarden 'f' en 'F'. We kunnen die ook meenemen in de filtering door eerst de casefold() functie te gebruiken om de string om te zetten naar kleine letters en vervolgens de eerste letter te vergelijken met 'f'. Zoek eens uit hoe je dat zou schrijven.

## Oefening 6
Het zou natuurlijk gemakkelijker zijn wanneer er maar 1 waarde was voor female en male. Welke twee statements heb je nodig om Female, female en F om te zetten naar f en Male, male en M om te zetten naar m. Kun je dat ook in 1 statement schrijven?

## Oefening 7
Sorteer de lijst op lNAME (oplopend)

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
33,Frank,Abrahamsen,23,Male,Norway,BI Residence,68,High School,152,NaN,70
61,Tore,Abrahamsen,22,Female,Norway,BI Residence,73,High School,144,70.0,55
59,Karoline,Ahmed,26,Female,Norway,BI Residence,76,High School,156,84.0,61
24,Odd,Ahmed,30,Male,Norway,BI Residence,82,Bachelors,156,82.0,65
51,Mwanaidi,Ali,32,Female,Somali,BI Residence,82,Bachelors,156,84.0,59
...,...,...,...,...,...,...,...,...,...,...,...
67,Lucas,Schmidt,33,Male,Germany,Sognsvann,98,Masters,160,87.0,86
54,Irene,Strømertan,38,Female,Norway,Private,80,Masters,158,84.0,50
41,Emily,Thompson,39,Female,UK,Private,90,Masters,158,85.0,74
1,Alex,Walekhwa,60,M,Kenya,Private,79,Diploma,150,60.0,75
10,Emma,de Vries,34,Female,Netherlands,BI Residence,65,Bachelors,156,79.0,58

## Oefening 8
Sorteer de lijst op prevEducation (oplopend) en vervolgens op gender (aflopend)

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
6,Ole,Johansen,27,Male,Norway,BI-Residence,90,Bachelors,156,80.0,91
8,Bjørn,Larsen,31,Male,Norway,BI Residence,88,Bachelors,156,80.0,89
14,Marco,Rossi,42,Male,Italy,Private,80,Bachelors,152,75.0,77
18,Sebastian,Kristiansen,48,Male,Norway,Private,75,Bachelors,148,76.0,73
24,Odd,Ahmed,30,Male,Norway,BI Residence,82,Bachelors,156,82.0,65
...,...,...,...,...,...,...,...,...,...,...,...
54,Irene,Strømertan,38,Female,Norway,Private,80,Masters,158,84.0,50
66,Anna,Müller,31,Female,Germany,Sognsvann,89,Masters,160,87.0,61
70,Emma,Janssen,39,Female,Netherlands,Private,81,Masters,160,80.0,71
74,Sophie,Brown,33,Female,UK,Sognsvann,96,Masters,158,85.0,90
11,Solveig,Eliassen,36,Female,Norway,Private,70,diploma,156,80.0,55

## Oefening 9
Sorteer op de punten voor Python een keer oplopend en aflopend. Waar staan de NA-waarden?
1. oplopend sorteren: NA achteraan, aflopend sorteren: NA vooraan
1. oplopend sorteren: NA achteraan, aflopend sorteren: NA achteraan
1. oplopend sorteren: NA vooraan, aflopend sorteren: NA achteraan
1. oplopend sorteren: NA vooraan, aflopend sorteren: NA vooraan

## Oefening 10
Hoe kun je oplopend sorteren op de punten van Python en ervoor zorgen dat de NaN-waarden eerst staan in de lijst.

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
3,Shoni,Hlongwane,22,F,Rsa,Sognsvann,40,High School,120,NaN,44
33,Frank,Abrahamsen,23,M,Norway,BI Residence,68,High School,152,NaN,70
53,Chinedu,Morison,36,M,Nigeria,Private,28,Diploma,120,15.0,67
21,Hanna,Isaksen,24,F,Norway,BI Residence,50,High School,114,30.0,50
32,Perry,Rønning,71,F,Norway,Private,30,Doctorate,120,31.0,42
...,...,...,...,...,...,...,...,...,...,...,...
5,Hannah,Hansen,25,F,Norge,BI Residence,66,High School,130,88.0,59
50,Dag,Arnesen,30,M,Norway,BI Residence,95,Diploma,160,90.0,89
34,Line,Næss,25,F,Norway,BI Residence,98,High School,160,90.0,90
58,Morten,Olsen,46,F,Norway,Private,94,Doctorate,160,90.0,77
4,Maria,Kedibone,23,F,South Africa,Sognsvann,65,High School,122,91.0,80

# Oplossingen
## Oplossing 1
```
df = pd.read_csv(BI_CSV, encoding='windows-1252', delimiter=',')
df.info()
```

## Oplossing 2
Je hebt verschillende mogelijkheden:
```
df['gender'].describe().loc['count']
df['gender'].describe().iloc[0]
#Om alleen de python objecten te zien:
df.describe(include='O')
```
## Oefening 3
Antwoorden 2 en 4: pd.unique(df.gender), df.gender.unique()

## Oefening 4
Antwoord 3:df[df.gender.str.casefold() == 'female'] 

## Oefening 5
Je mag de tweede .str. niet vergeten
```
df[df.gender.str.casefold().str.slice(0,1)== 'f']
df[df.gender.str.casefold().str[:1]== 'f']
df[df.gender.str.casefold().str.startswith('f')]
```

## Oplossing 6
In één regel:
```
df.loc[:, 'gender'] = df.gender.str.casefold().str.slice(0, 1).str.upper()
df.describe(include='O')
```

## Oplossing 7
```
df.sort_values('lNAME')
of
df.lNAME.sort_values()
```

## Oplossing 8
```
df.sort_values(['prevEducation', 'gender'], ascending=[True, False])
```

## Oplossing 9
Antwoord 2: oplopend sorteren: NA achteraan, aflopend sorteren: NA achteraan

## Oplossing 10
```
df.sort_values('Python', ascending=True, na_position='first')
```